{
  "proposals": [
    {
      "id": "984",
      "messages": [
        {
          "@type": "/cosmos.distribution.v1beta1.MsgCommunityPoolSpend",
          "authority": "cosmos10d07y265gmmuvt4z0w9aw880jnsr700j6zn9kn",
          "recipient": "cosmos1jskgwzken05wjflz2f92hn3apa0pql6nxtj947dtlqwrkk88q8pq35gtq5",
          "amount": []
        }
      ],
      "status": "PROPOSAL_STATUS_VOTING_PERIOD",
      "final_tally_result": {
        "yes_count": "0",
        "abstain_count": "0",
        "no_count": "0",
        "no_with_veto_count": "0"
      },
      "submit_time": "2025-01-09T01:32:15.244284891Z",
      "deposit_end_time": "2025-01-23T01:32:15.244284891Z",
      "total_deposit": [
        {
          "denom": "uatom",
          "amount": "500000000"
        }
      ],
      "voting_start_time": "2025-01-09T01:32:15.244284891Z",
      "voting_end_time": "2025-01-23T01:32:15.244284891Z",
      "metadata": "{\"title\":\"Funding Hydro development & integrations in 2025\",\"summary\":\"This proposal requests community approval to fund Hydro product development and some Hydro-focused grants for the first two quarters of 2025 by giving Informal a green light to re-assign the excess Q4 2024 budget to Hydro and approving the transfer of an additional 180,000 ATOM from the community pool. In addition, since we believe that Hydro could be partly self-funded in the second half of 2025, we're requesting community approval to send Hydro's PoL profits to an account collectively owned by Hydro's voters but placed under the control of the Cosmos Hub community (see the Hydro Treasury section for details).\\n\\nThe full funding proposal details and discussion are available on the [Cosmos Hub Forum](https://forum.cosmos.network/t/funding-hydro-development-integrations-in-2025/14900/1).\\n\\n## Governance votes\\n- **Yes**: You approve the allocation of Informal Systems' excess Q4 budget and an additional 180,000 ATOM from the community pool towards Hydro product development and integrations, and you approve the transfer of Hydro's PoL rewards to the Hydro Treasury.\\n- **No**: You do not approve the suggested budget allocation and / or the transfer of Hydro's PoL rewards to the Hydro Treasury.\\n- **No with Veto**: You indicate that this proposal either (1) is deemed to be spam, i.e., irrelevant to Cosmos Hub, (2) disproportionately infringes on minority interests, or (3) violates or encourages violation of the rules of engagement as currently set out by Cosmos Hub.\\n- **Abstain**: You wish to contribute to the quorum, but you decline to vote either for or against.\",\"ipfs\":\"\",\"forum\":\"https://forum.cosmos.network/t/funding-hydro-development-integrations-in-2025/14900/1\"}",
      "title": "Funding Hydro development & integrations in 2025",
      "summary": "This proposal requests community approval to fund Hydro product development and some Hydro-focused grants for the first two quarters of 2025 by giving Informal a green light to re-assign the excess Q4 2024 budget to Hydro and approving the transfer of an additional 180,000 ATOM from the community pool. In addition, since we believe that Hydro could be partly self-funded in the second half of 2025, we're requesting community approval to send Hydro's PoL profits to an account collectively owned by Hydro's voters but placed under the control of the Cosmos Hub community (see the Hydro Treasury section for details).\n\nThe full funding proposal details and discussion are available on the [Cosmos Hub Forum](https://forum.cosmos.network/t/funding-hydro-development-integrations-in-2025/14900/1).\n\n## Governance votes\n- **Yes**: You approve the allocation of Informal Systems' excess Q4 budget and an additional 180,000 ATOM from the community pool towards Hydro product development and integrations, and you approve the transfer of Hydro's PoL rewards to the Hydro Treasury.\n- **No**: You do not approve the suggested budget allocation and / or the transfer of Hydro's PoL rewards to the Hydro Treasury.\n- **No with Veto**: You indicate that this proposal either (1) is deemed to be spam, i.e., irrelevant to Cosmos Hub, (2) disproportionately infringes on minority interests, or (3) violates or encourages violation of the rules of engagement as currently set out by Cosmos Hub.\n- **Abstain**: You wish to contribute to the quorum, but you decline to vote either for or against.",
      "proposer": "cosmos1tvqum6psu8waphaatuau2gxpaay4z7zlntmhkv",
      "expedited": false,
      "failed_reason": ""
    },
    {
      "id": "985",
      "messages": [
        {
          "@type": "/cosmos.distribution.v1beta1.MsgCommunityPoolSpend",
          "authority": "cosmos10d07y265gmmuvt4z0w9aw880jnsr700j6zn9kn",
          "recipient": "cosmos1ax7krw2ymq8upaxwce7df3xpalpp0jddm29fws",
          "amount": [
            {
              "denom": "ibc/F663521BF1836B00F5F177680F74BFB9A8B5654A694D0D2BC249E03CF2509013",
              "amount": "200000000000"
            },
            {
              "denom": "uatom",
              "amount": "86538460000"
            }
          ]
        }
      ],
      "status": "PROPOSAL_STATUS_VOTING_PERIOD",
      "final_tally_result": {
        "yes_count": "0",
        "abstain_count": "0",
        "no_count": "0",
        "no_with_veto_count": "0"
      },
      "submit_time": "2025-01-09T20:15:56.955890109Z",
      "deposit_end_time": "2025-01-23T20:15:56.955890109Z",
      "total_deposit": [
        {
          "denom": "uatom",
          "amount": "500000000"
        }
      ],
      "voting_start_time": "2025-01-09T21:42:22.330319622Z",
      "voting_end_time": "2025-01-23T21:42:22.330319622Z",
      "metadata": "ipfs://QmbUGTtewn3tVaYjw2ezDtzAC2s7SY2XgNibmAUUZQqC3b",
      "title": "Fund testnets and mainnet ops by Hypha in 2025",
      "summary": "# Fund testnets and mainnet ops by Hypha in 2025\r\n\r\n## Summary\r\n\r\nThe Hub testnets team at Hypha Worker Co-operative is seeking funding to continue their mandate of stewarding the Hub's testnet, supporting mainnet operations, and development support and onboarding for the incoming Hub team at Interchain Inc.\r\n\r\nThis proposal is summarized by the following propositions:\r\n\r\n* The approval of a $650,000 USD budget to finance Hypha's:\r\n  * Stewardship of the Hub's provider testnet as a dev platform and validator training program\r\n  * Mainnet coordination for upgrades and validators\r\n  * Coordination around bug fixes, security patches, and version updates for core technologies\r\n  * Mainnet ICS support for the Hub's current and prospective consumer chains\r\n  * Validation testing for core stack integrations and new features\r\n  * Testing and development support for patches and version update releases\r\n  * Onboarding and transition support for Skip/Interchain Inc.\r\n* The release of the following funds to a Hypha-controlled wallet (cosmos1ax7krw2ymq8upaxwce7df3xpalpp0jddm29fws):\r\n  * 200k USDC (shown in the spend proposal details as 200,000,000,000 IBC-wrapped uusdc)\r\n  * 86,538.46 ATOM (accounting for 69,230.77 ATOM at a spot price of \\$6.5 USD with a 25\\% buffer to cover price fluctuations) to be converted to \\$450k USDC via the process laid out in the full text of the proposal\r\n* The approval of Hypha's transparency and accountability commitment to the ATOM community:\r\n  * Quarterly reports made to the Cosmos Hub forum\r\n  * Quarterly withdrawal reports on community-disbursed funds\r\n  * An anonymous feedback form and commitment to publicly reviewing and incorporating relevant feedback\r\n  * Cooperation with the ATOM community if a signalling proposal is passed to return any unused funds\r\n  * Cooperation with teams chosen by the ATOM community to fulfil other scopes of work or to replace our services on the Hub\r\n\r\n## Additional details\r\n* [Full proposal text with changelog and discussion (forum post)](https://forum.cosmos.network/t/proposal-last-call-fund-testnets-and-mainnet-ops-by-hypha-in-2025/14929)\r\n* [IPFS pin of full text](https://ipfs.io/ipfs/QmbUGTtewn3tVaYjw2ezDtzAC2s7SY2XgNibmAUUZQqC3b) and comments\r\n\r\n## Governance votes and outcomes\r\n\r\nThe following items summarize the voting options and what it means for this proposal:\r\n\r\n* **YES**: You agree to fund the Hub testnets team at Hypha Worker Co-operative with a $650k USD budget for continued testnet stewardship, mainnet coordination, and development support over the period of January 1, 2025 - December 31, 2025. A 'YES' outcome will immediately release 200k USDC and 86,538.46 ATOM to the specified wallet (cosmos1ax7krw2ymq8upaxwce7df3xpalpp0jddm29fws).\r\n * **NO**: You do not agree to fund the Hub testnets team at Hypha Worker Co-operative based on the terms of this proposal.\r\n* **NO WITH VETO**: A 'NoWithVeto' vote indicates a proposal either (1) is deemed to be spam, i.e., irrelevant to Cosmos Hub, (2) disproportionately infringes on minority interests, or (3) violates or encourages violation of the rules of engagement as currently set out by Cosmos Hub governance. If the number of 'NoWithVeto' votes is greater than a third of total votes, the proposal is rejected and the deposits are burned.\r\n* **ABSTAIN**: You wish to contribute to the quorum but you formally decline to vote either for or against the proposal.\r\n",
      "proposer": "cosmos1cc5mtuje84sx5dsqw4gtr4w8lthpzw02rjjnew",
      "expedited": false,
      "failed_reason": ""
    },
    {
      "id": "986",
      "messages": [
        {
          "@type": "/cosmos.distribution.v1beta1.MsgCommunityPoolSpend",
          "authority": "cosmos10d07y265gmmuvt4z0w9aw880jnsr700j6zn9kn",
          "recipient": "cosmos1jskgwzken05wjflz2f92hn3apa0pql6nxtj947dtlqwrkk88q8pq35gtq5",
          "amount": [
            {
              "denom": "uatom",
              "amount": "180000000000"
            }
          ]
        }
      ],
      "status": "PROPOSAL_STATUS_VOTING_PERIOD",
      "final_tally_result": {
        "yes_count": "0",
        "abstain_count": "0",
        "no_count": "0",
        "no_with_veto_count": "0"
      },
      "submit_time": "2025-01-10T16:01:25.881366176Z",
      "deposit_end_time": "2025-01-24T16:01:25.881366176Z",
      "total_deposit": [
        {
          "denom": "uatom",
          "amount": "500000000"
        }
      ],
      "voting_start_time": "2025-01-10T17:40:09.370644751Z",
      "voting_end_time": "2025-01-24T17:40:09.370644751Z",
      "metadata": "[v2] Funding Hydro development & integrations in 2025",
      "title": "[v2] Funding Hydro development & integrations in 2025",
      "summary": "## Note\nThis proposal supersedes [Prop #984](https://www.mintscan.io/cosmos/proposals/984), which doesn't include the requested amount of ATOM and won’t transfer any funds when executed (see the transaction hash of the proposal creation [here](https://www.mintscan.io/cosmos/tx/0488ADC4956A52C8220127CE79E3C72FCEA42D602C6250FB348AF2D2EA1A2D8A)).\n\nTherefore, we recommend to cast a Yes vote on Prop #984 (which won't execute anyway), as well as this proposal.\n\n\n## Introduction\nIn November 2023, the [Cosmos Hub funded Informal Systems for 2024](https://www.mintscan.io/cosmos/proposals/839). The Informal Hub team eliminated the Hub’s technical debt and shipped two products:\n- [Forge](https://forge.cosmos.network/) as a way to permissionlessly launch a chain, solving all the pain points of the past versions of ICS and making it possible for the Hub's validators to run it in a few clicks.\n- [Hydro](https://hydro.cosmos.network/) as the first decentralized market-maker. Hydro allocates liquidity through sequential auction rounds in which projects attract user votes with tributes\n\nThrough this process, it became obvious that [the Hub needed consolidated leadership](https://forum.cosmos.network/t/cosmos-hub-informal-systems/) to realize its full potential and Informal recruited one of the best teams in the Interchain to take up [the product ownership role](https://medium.com/the-interchain-foundation/cosmos-is-expanding-skip-joins-the-interchain-foundation-cfd346551dda). Although Informal’s Hub 2024 mandate officially ends on 31-Dec, with the recent success of the first pilot rounds, the Skip team asked the Hydro team to keep developing the product in 2025. \n\nSince the Informal Hub team is under budget in Q4 2024 (see the breakdown in the Funding & reporting section - the Informal Hub team was also under budget in Q1 & Q2 2024 and [returned these funds](https://x.com/informalinc/status/1830971210479607996) to the community pool), this proposal requests community approval to fund Hydro product development and some Hydro-focused grants for the first two quarters of 2025 by giving Informal a green light to re-assign [the excess Q4 2024](https://forum.cosmos.network/t/informal-hub-team-q4-24-retro/15024#p-34603-financial-transparency-reporting-10) budget to Hydro and approving the transfer of an additional 180,000 ATOM from the community pool.\n\nIn addition, since we believe that Hydro could be partly self-funded in the second half of 2025, we’re requesting community approval to send Hydro’s PoL profits to an account collectively owned by Hydro’s voters but placed under the control of the Cosmos Hub community (see the Hydro Treasury section for details).\n\n## Hydro Roadmap\nThe Hydro litepaper was published in [late May-2024](https://forum.cosmos.network/t/atom-wars-introducing-the-hydro-auction-platform/) and the inaugural pilot round started on [6-Nov](https://x.com/cosmoshub/status/1854234305909956717). To date, 10 projects have submitted bids and 8 third-party teams have also expressed interest in building DeFi apps on top of Hydro. The round 1 cap was reached within 24 hours and the round 2 cap in less than 4 minutes.\n\nIn the last couple of months, the Hydro team has also worked on several major updates:\n- **Custom deployment duration**: Projects can set their own export duration and voters can lock-in a fixed APR over several rounds without having to vote every time.\n- **Custom export floor**: Projects can set a minimum PoL target. If their bid doesn’t get sufficient support to reach that target, their tribute is refunded.\n- **Metrics page**: The position size, status and performance of each PoL deployment is tracked and displayed on a dedicated page.\n- **Rewards page**: Voters can see their tribute rewards and personalized APRs (current & past rounds). They can claim and automatically swap tokens to ATOM. \n- **Airdrops page**: Voters can see a list of upcoming airdrops for Hydro participants, and projects can easily access relevant data.\n\nThe custom deployment duration and custom export floor are critical for making Hydro more widely useful to larger projects. However, Hydro is still far from a finished product. \n- It relies on a committee for risk management, whitelisting & performance monitoring.\n- The incentive alignment between voters & the community pool is relatively weak.\n\nThe goal is to make Hydro a fully permissionless, automated, risk-minimizing & profit-maximizing system for efficient treasury management on a public blockchain. Hydro should be able to operate like Aave, Compound, or Curve: risk parameter approvals via governance votes, allocations via the auction system, and automatic deployments.\n\nOver the first 6 months of 2025, the Hydro team plans to work on the following features:\n\n\n\n| Feature | Description | \n| -------- | -------- | \n| Third-party integrations     | Vote optimizers, automated hedging contracts, insurance premium or escrow contracts can be built on top of Hydro to enable new cases    | \n| Valence integration | The Hub retains ownership of Hydro’s liquidity, making the committee less of a bottleneck and increasing the overall security & efficiency of the system. | \n| Token integrations | Hydro can be used for the deployment of new tokens ( NTRN, TIA, stables etc.), and projects can submit atomic bids to get both sides of an LP pair | \n| Rev-sharing & penalities | Voters get a portion of the PoL yield. A portion of the users' locked capital gets slashed when they vote for a project that underperforms. | \n| Hydro governance | Hydro users can vote on governance proposals to define all of the protocol parameters and elect or remove committee members | \n| Staking interface | Hydro users can stake, delegate, re-delegate, claim, swap and compound rewards directly from the Hydro interface | \n| “Just-in-time” liquidity | Hydro provides insurance against liquidity crunches by ensuring that buckets can be deployed quickly to stabilize a position or market. | \n\nNote that this is a working backlog that will be re-prioritized based on market signals and community feedback.\n\n## Budget\n### Product development\nThe Informal Hub team in 2024 consisted of 14 people, split between Forge, Hydro and Hub maintenance. For 2025, we believe it is possible to achieve our Hydro objectives with a reduced team of 6 Full-Time Equivalent staff: 1 Project Lead, 1 Technical Lead, 1 Product Lead, 2 Developers & 1 Growth Lead. We will use the same per-head total rate averages of $325K per year, which includes approximately $225K in salary (and relevant overhead such as employer taxes and benefits) and a standard margin to pay for operational expenses like legal, HR, finance as well as some profit buffer for the company. Like last year, these rates are aligned with the mid-point of market software development rates ($110-$220/hour)\n\nThe entire overhead margin will be paid out in ATOMs for alignment purposes. In addition, our proposal will not include any performance bonus (Informal & Hypha 2024 proposal did). See the FAQ section for more details on these decisions. \n\n### Hydro grants\nTo become a fully permissionless & automated protocol, Hydro requires several DeFi & security integrations. While Hydro's core team itself could develop all the necessary features over time, a better option to achieve this goal as fast and cost-efficiently as possible is to enable other third-party teams to build products on top of Hydro. \n\n\n\n| Category | Budget |\n| -------- | -------- |\n| Vote optimizers     | Vote aggregators are smart contract applications that abstract the complexities of voting away from users, give them the benefits of long-term locking, provide them with a tradable liquid derivative, compete for maximal returns, etc.      |\n| Delta-neutral deployments | Automated strategies are required to avoid exposing the Hub deployments to impermanent loss. Hydro’s bidders can implement a delta-neutral strategy with a real-time adjustment mechanism via smart contracts, insurance, or over-collateralization |\n| Permissionless deployments | The Hub retains direct ownership of the liquidity, progressively reducing the need for the Hydro committee to manually deploy funds, enabling shorter and more competitive rounds, and increasing the system's overall security. |\n| Security | Third-party audits for the features developed by the Hydro product team. Security monitoring, threat detection system, and bug-bounty program for finding and reporting vulnerabilities on PoL venues. |\n\n\nOver the past couple of weeks, the Hydro team has been helping several Cosmos projects submit well-scoped grant proposals to the AADAO so their applications can be processed before the [end of the program](https://forum.cosmos.network/t/sunsetting-atom-accelerator-dao-aadao/). However, new teams / existing grantees are likely to step forward with other ideas during the coming months, and the Hydro team may also try to outsource “nice-to-have” features and support work (relaying, infrastructure, community) to external partners. For that reason, the proposal includes a $350,000 budget to manage an ecosystem fund that will support the initiatives listed in the table below (each item is a rough estimate and the final distribution may look significantly different). All outgoing transactions will be managed on-chain via DAO DAO and labeled for transparency. \n\n\n\n| Initiative | Budget | Amount |\n| -------- | -------- | -------- |\n| Hydro committee     | ~$90/h for six members for 6 months, 5-10h per member per month (adjusted up or down based on individual time commitment)     | $40,000     |\n| Vote optimizers     | ~$30,000 for smart contract development or audits for two separate teams (adjusted up or down based on a statement of work)     | $60,000     |\n| Automated hedging     | ~$30,000 for the smart contract development or audits (adjusted up or down based on a statement of work)     | $30,000     |\n| Insurance premiums     | ~$30,000 for the smart contract development or audits (adjusted up or down based on a statement of work)     | $30,000     |\n| Valence integration     | ~ $50,000 for a first integration of Valence into Hydro (adjusted up or down based on the exact scope)     | $50,000     |\n| Data services     | ~ $20,000 for the tracking of PoL deployments & rewards (adjusted up or down based on development & indexing costs)     | $20,000     |\n| Security audits     | ~ $25,000 per audit & 1 per quarter from a reputable firm (adjusted up or down based on the exact scope)     | $50,000     |\n| Bug bounties     | ~ $10,000 per bug submission for up to five security issues during a six-month period     | $50,000     |\n| Miscellaneous      | ~ $20,000 for IBC relaying, security monitoring, infrastructure costs, software licenses and other miscellaneous expenses     | $20,000     |\n\nNote that the Hydro team submitted a $350,000 grant application to the AADAO, which was downsized to $75,000. The amount has been discounted from the ask (see Funding section below).\n\n## Hydro treasury\nThe rewards generated by the Hub’s PoL deployments are currently in the custody of the Hydro committee. The Hydro product team is planning to build out a governance module and equip it with the ability to hold and manage funds. \n\nThe purpose of the Hydro treasury is two-fold:\n- Ability to deploy the rewards via Hydro\n- Ability to fund development teams \n\nThe Hydro treasury transforms Hydro into a self-funded project and may eliminate the need for more community pool requests to the Hub community pool. The treasury would remain under the control of the Cosmos Hub via two mechanisms to be built into Hydro governance:\n- The ability for the Hub governance to veto any Hydro prop via an expedited proposal\n- The ability for the Hub governance to send the Hydro treasury to the community pool\n\nIf this proposal passes, the Hydro product team will transfer pre-Hydro and pilot rounds PoL rewards to a new public DAO on DAO DAO and start building the Hydro governance module and treasury. The DAO will initially be controlled by the product team and ownership will be transferred to Hydro’s governance as soon as it is technically possible. \n\n## Funding & reporting\n\n### Proposal request\nIn its [2024 funding proposal](https://www.mintscan.io/cosmos/proposals/839), the Informal Hub team planned for a total team of 14 full-time equivalents (FTE) per quarter:\n- In Q1 & Q2, the team was under budget and [returned funds](https://x.com/informalinc/status/1830971210479607996) to the community pool\n- In Q3, the team worked at full capacity to ship Forge & Hydro.\n- In Q4, the team was under budget again, using [only 10 FTE resources](https://forum.cosmos.network/t/informal-hub-team-q4-24-retro/15024#p-34603-financial-transparency-reporting-10).\n\nThe [excess budget](https://forum.cosmos.network/t/informal-hub-team-q4-24-retro/15024#p-34603-financial-transparency-reporting-10) represented by 4 FTE in Q4 is $225,714 USDC and 10,214.29 ATOM. We suggest assigning this funding to cover Hydro product development in the first half of 2025. Assuming 1 ATOM is worth $6.5 (and rounding conversion numbers), the breakdown is the following:\n\n\n\n| Budget line  | In USD | In ATOM |\n| -------- | -------- | -------- |\n| Hydro Team     | $975,000     | 150,000     |\n| Hydro Grants     | $350,000     | 55,000     |\n| Reassigned 2024 funding     | $-290,000     | -45,000     |\n| Temporary 20% buffer     | $207,000     | 31,000     |\n| AADAO grant     | $-75,000     | -11,000     |\n| **Total**     | $1,167,000     | 180,000     |\n\nThe funding request amount includes a 20% buffer to hedge against ATOM price movement (both for the reassigned Q4 2024 funding and the new 2025 funding):\n- If the ATOM price is exactly the same at the time of the Q1 & Q2 transfers as when the prop went up for voting, the entire 20% buffer will be sent to the Hydro treasury\n- If the ATOM price **decreases** less than 20%, the buffer will be used to cover the difference. If the ATOM price **increases**, the extra will be sent to the Hydro treasury. \n- If the ATOM price goes down more than 20%, the Hydro product team will request the difference to be covered by the Hydro treasury (see the description below).\n\n### Sequence of events\n\nFunding will be distributed on the following schedule:\n\n| Date | Action | \n| -------- | -------- | \n| On 24-Jan     | The total ask (including buffer) of 180,000 ATOMs is transferred from the community pool to the [Hydro Team DAO](https://daodao.zone/dao/cosmos1jskgwzken05wjflz2f92hn3apa0pql6nxtj947dtlqwrkk88q8pq35gtq5/home)     |\n| On 25-Jan     | The Hydro Team converts the relevant number of ATOM into 975,000 * 70% + 275,000 - 290,000 = 667,500 USDC and sends 275,000 USDC to the [Hydro Grants DAO](https://daodao.zone/dao/cosmos1stxad87r0c9x9skn5ap6eyx9wwmj5xuqcpd3n974qpg5stv92sqqj2zrh4/members)     | \n| Before 24-Jun     | The Hydro Team and Hydro Grants DAOs send all excess USDC & ATOM funds (including buffer) to the Hydro Treasury     | \n\n\nA new separate entity will receive the distributed funds. This new company (name & domicile to be determined) will be created specifically for Hydro product development. As a company, Informal Systems will be focusing on engineering services, security audits and public good development for devcos and foundations with clear service agreements.\n\nUndistributed funds can be clawed back via a proposal submitted by any community member (the tooling introduced by [Prop 972](https://www.mintscan.io/cosmos/proposals/972) could be used). Assuming funds are not clawed back before, all excess budget shall be sent to the Hydro Treasury at the end of the mandate.\n\n### Reporting\nA quarterly progress report will be shared on the Cosmos Hub forum by the Hydro development team, using the same format as the reporting done by the Informal Hub team (see [Q1 2024](https://forum.cosmos.network/t/informal-systems-q1-24-retro-q2-24-plan/13749), [Q2 2024](https://forum.cosmos.network/t/informal-hub-team-q2-24-retro-q3-24-plan/14158), [Q3 2024](https://forum.cosmos.network/t/informal-hub-team-q3-24-retro-q4-24-plan/14684), [Q4 2024](https://forum.cosmos.network/t/informal-hub-team-q4-24-retro/15024/1)).\n\n## Governance votes\n\n**Yes**: You approve the allocation of Informal Systems excess Q4 budget and an additional 180,000 ATOM from the community pool towards Hydro product development and integrations, and you approve the transfer of Hydro’s PoL rewards to the Hydro Treasury.\n\n**No**: You do not approve the suggested budget allocation and / or the transfer of Hydro’s PoL rewards to the Hydro Treasury.\n\n**No with Veto**: You indicate that this proposal either (1) is deemed to be spam, i.e., irrelevant to Cosmos Hub, (2) disproportionately infringes on minority interests, or (3) violates or encourages violation of the rules of engagement as currently set out by Cosmos Hub.\n\n**Abstain**: You wish to contribute to the quorum, but you decline to vote either for or against.",
      "proposer": "cosmos1tvqum6psu8waphaatuau2gxpaay4z7zlntmhkv",
      "expedited": false,
      "failed_reason": ""
    },
    {
      "id": "987",
      "messages": [
        {
          "@type": "/cosmos.upgrade.v1beta1.MsgSoftwareUpgrade",
          "authority": "cosmos10d07y265gmmuvt4z0w9aw880jnsr700j6zn9kn",
          "plan": {
            "name": "v22",
            "time": "0001-01-01T00:00:00Z",
            "height": "24181000",
            "info": "{\"binaries\": {\"darwin/amd64\": \"https://github.com/cosmos/gaia/releases/download/v22.0.0/gaiad-v22.0.0-darwin-amd64?checksum=sha256:4cca58005d1d9201f61df0f52f81695c9c0955faf2a4ae4e680344c23b0458cc\",\"darwin/arm64\":\"https://github.com/cosmos/gaia/releases/download/v22.0.0/gaiad-v22.0.0-darwin-arm64?checksum=sha256:480e5fed24da19457d3937767541c2bfaec679ea60633737dec0a83d2b6a6af3\",\"linux/amd64\":\"https://github.com/cosmos/gaia/releases/download/v22.0.0/gaiad-v22.0.0-linux-amd64?checksum=sha256:e2d4eb6bfdc91294cb0a43eb9ffbfb160c3b99a057e5e09b5dacae8e58410a04\"}}",
            "upgraded_client_state": null
          }
        }
      ],
      "status": "PROPOSAL_STATUS_VOTING_PERIOD",
      "final_tally_result": {
        "yes_count": "0",
        "abstain_count": "0",
        "no_count": "0",
        "no_with_veto_count": "0"
      },
      "submit_time": "2025-01-17T20:30:30.389376455Z",
      "deposit_end_time": "2025-01-31T20:30:30.389376455Z",
      "total_deposit": [
        {
          "denom": "uatom",
          "amount": "501000000"
        }
      ],
      "voting_start_time": "2025-01-17T20:43:50.450810322Z",
      "voting_end_time": "2025-01-24T20:43:50.450810322Z",
      "metadata": "ipfs://CID",
      "title": "Gaia v22 Software Upgrade",
      "summary": "## Background\r\n \r\nGaia v22 is a major release that will follow the standard governance process for software upgrades on the Cosmos Hub. Feedback on this proposal will be open for roughly 1 week.\r\n \r\nReminder – the Cosmos Hub uses expedited voting for software upgrade proposals. This proposal will have a voting period of just **ONE WEEK**.\r\n \r\nIf the proposal passes, validators will be required to update the Cosmos Hub binary at the halt-height specified in the on-chain proposal.\r\n \r\n## Release Details\r\n \r\n* The release candidate can be found[ here](https://github.com/cosmos/gaia/releases/tag/v22.0.0).\r\n* The changelog can be found[ here](https://github.com/cosmos/gaia/blob/v22.0.0/CHANGELOG.md).\r\n \r\nThis release adds no major features.\r\n \r\nThe release bumps the following dependencies:\r\n \r\n* Bump [ibc-go](https://github.com/cosmos/ibc-go) to [v8.5.2](https://github.com/cosmos/ibc-go/releases/tag/v8.5.2) ([#3370](https://github.com/cosmos/gaia/pull/3370))\r\n* Bump [cometbft](https://github.com/cometbft/cometbft) to [v0.38.15](https://github.com/cometbft/cometbft/releases/tag/v0.38.15) ([#3370](https://github.com/cosmos/gaia/pull/3370))\r\n* Bump [cosmos-sdk](https://github.com/cosmos/cosmos-sdk) to [v0.50.11-lsm](https://github.com/cosmos/cosmos-sdk/releases/tag/v0.50.11-lsm) ([#3454](https://github.com/cosmos/gaia/pull/3454))\r\n* Bump [wasmd](https://github.com/CosmWasm/wasmd) to [v0.53.2](https://github.com/CosmWasm/wasmd/releases/tag/v0.53.2) ([#3459](https://github.com/cosmos/gaia/pull/3459))\r\n* Bump [ICS](https://github.com/cosmos/interchain-security) to [v6.4.0](https://github.com/cosmos/interchain-security/releases/tag/v6.4.0). ([#3474](https://github.com/cosmos/gaia/pull/3474))\r\n \r\n**This upgrade is state-breaking and mandatory once the on-chain vote passes and the upgrade-height is reached.**\r\n \r\n## Testing and Testnets\r\n \r\nThe v22 release has gone through rigorous testing, including e2e tests, and integration tests by Informal Systems. In addition, the v22 upgrade process has been independently tested by the team at Hypha Co-op and has been performed by validators and node operators on a public testnet prior to cutting the final release.\r\n \r\nIf you wish to participate in the testnet upgrade process in the future, you can find the relevant information (genesis file, peers, etc.) to join the Cosmos Hub's Interchain Security Testnet (provider) [here](https://github.com/cosmos/testnets/tree/master/interchain-security).\r\n \r\n### Potential risk factors\r\n \r\nAlthough extensive testing and simulation will have taken place there always exists a risk that the Cosmos Hub might experience problems due to potential bugs or errors. In the case of serious problems, validators should stop operating the network immediately.\r\n \r\nCoordination with validators will happen in the[ #cosmos-hub-validators-verified](https://discord.com/channels/669268347736686612/798937713474142229) channel of the Cosmos Network Discord to create and execute a contingency plan. Likely this will be an emergency release with fixes or the recommendation to consider the upgrade aborted and revert back to the previous release of gaia (v21.0.1).\r\n \r\n### Governance votes\r\n \r\nThe following items summarize the voting options and what it means for this proposal:\r\n \r\nYES - You agree that the Cosmos Hub should be updated with this release.\r\n \r\nNO - You disagree that the Cosmos Hub should be updated with this release.\r\n \r\nNO WITH VETO - A 'NoWithVeto' vote indicates a proposal either (1) is deemed to be spam, i.e., irrelevant to Cosmos Hub, (2) disproportionately infringes on minority interests, or (3) violates or encourages violation of the rules of engagement as currently set out by Cosmos Hub governance. If the number of 'NoWithVeto' votes is greater than a third of total votes, the proposal is rejected and the deposits are burned.\r\n \r\nABSTAIN - You wish to contribute to the quorum but you formally decline to vote either for or against the proposal.",
      "proposer": "cosmos1az2sxspr9mfv407ay7ktcqjj57zre2dxcjecfd",
      "expedited": true,
      "failed_reason": ""
    }
  ],
  "pagination": {
    "next_key": null,
    "total": "0"
  }
}
